## Ćwiczenia dotyczące grupowania i czyszczenia danych

Poniżej znajdziesz cztery ćwiczenia, które pomogą Ci przećwiczyć umiejętności związane z grupowaniem i czyszczeniem danych.

### Ćwiczenie 1: Czyszczenie danych tekstowych

Zaimportuj poniższy przykładowy zbiór danych i wyczyść kolumnę Product poprzez usunięcie zbędnych spacji oraz zamianę tekstu na małe litery.

In [2]:
import pandas as pd

In [3]:
data1 = {
    'Product': ['  Apple  ', ' Banana', '  ORANGE ', 'Strawberry', 'blueberry '],
    'Quantity': [10, 15, 8, 20, 5],
    'Price': [1.5, 0.5, 0.75, 2.0, 1.0]
}
df1 = pd.DataFrame(data1)

In [5]:
df1['Product'] = df1['Product'].str.strip().str.lower()
df1

      Product  Quantity  Price
0       apple        10   1.50
1      banana        15   0.50
2      orange         8   0.75
3  strawberry        20   2.00
4   blueberry         5   1.00

### Ćwiczenie 2: Usuwanie duplikatów

Zaimportuj poniższy przykładowy zbiór danych i usuń duplikaty na podstawie kolumn Product i Store.

In [6]:
data2 = {
    'Product': ['Apple', 'Banana', 'Orange', 'Apple', 'Banana'],
    'Store': ['Store2', 'Store1', 'Store1', 'Store2', 'Store2'],
    'Quantity': [10, 20, 10, 10, 20]
}
df2 = pd.DataFrame(data2)

In [8]:
df2 = df2.drop_duplicates(subset=['Product', 'Store'])
df2

  Product   Store  Quantity
0   Apple  Store2        10
1  Banana  Store1        20
2  Orange  Store1        10
4  Banana  Store2        20

### Ćwiczenie 3: Grupowanie i agregacja danych

Zaimportuj poniższy przykładowy zbiór danych i pogrupuj dane według kolumny Store, a następnie oblicz sumaryczną ilość (Quantity) i średnią cenę (Price) w każdej grupie.

In [10]:
data3 = {
    'Product': ['Apple', 'Banana', 'Orange', 'Strawberry', 'Blueberry'],
    'Store': ['Store1', 'Store1', 'Store2', 'Store2', 'Store2'],
    'Quantity': [10, 20, 15, 5, 10],
    'Price': [1.5, 0.5, 0.75, 2.0, 1.0]
}
df3 = pd.DataFrame(data3)

In [12]:
group_df3 = df3.groupby('Store').agg({'Quantity': 'sum', 'Price': 'mean'})
group_df3 = group_df3.rename(columns={'Price': 'Average Price'})
group_df3

        Quantity  Average Price
Store
Store1        30           1.00
Store2        30           1.25